
##1. 查询所有省

|相关信息|内容|
|--|--|
|访问类型|POST|
|访问地址|/api/geo/QueryAllProvince|

###请求参数

|参数名称|是否必填|类型|说明|示例数据|
|--|--|--|--|--|--|
|user_id|是|字符串|用户ID||
|token|是|字符串|token||


###请求示例
<pre>
<code>
{
  "user_id": "7EA064BF-C4F9-4BC7-88C4-A0BDA3BDF0DB",
  "token": "b10705de-9704-4160-aa90-aafa11c5305b"

}
</code>
</pre>

###返回结果示例

<pre>
<code>

    {
       "code": 1,
       "message": "操作成功",
       "result_data":
       [
           "安徽",
           "北京",
           "福建",
           "甘肃",
           "广东",
           "广西",
           "河北",
           "河南",
           "黑龙江",
           "湖北",
           "湖南",
           "吉林",
           "江苏",
           "江西",
           "辽宁",
           "内蒙古",
           "山东",
           "山西",
           "陕西",
           "上海",
           "四川",
           "天津",
           "新疆",
           "云南",
           "浙江",
           "重庆"
       ]
    }

</code>
</pre>



##2 ，通过省查询下面的所有市

|相关信息|内容|
|--|--|
|访问类型|POST|
|访问地址|/api/geo/QueryCityByProvince|

###请求参数

|参数名称|是否必填|类型|说明|示例数据|
|--|--|--|--|--|--|
|user_id|是|字符串|用户ID||
|token|是|字符串|token||
|province|是|字符串|省份名称|


###请求示例
<pre>
<code>
{
  "user_id": "7EA064BF-C4F9-4BC7-88C4-A0BDA3BDF0DB",
  "token": "b10705de-9704-4160-aa90-aafa11c5305b",
"province":"安徽"

}
</code>
</pre>

###返回结果示例

<pre>
<code>


    {
       "code": 1,
       "message": "操作成功",
       "result_data":
       [
           "安庆",
           "蚌埠",
           "亳州",
           "巢湖",
           "池州",
           "滁州",
           "阜阳",
           "合肥",
           "淮北",
           "淮南",
           "黄山",
           "六安",
           "马鞍山",
           "铜陵",
           "芜湖",
           "宿州",
           "宣城"
       ]
    }



</code>
</pre>


